Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: If you already have your Quarkus project configured, you can add the `spring-scheduled` extension to your project by running the following command in your project base directory:
ja_jp: すでにQuarkusプロジェクトが設定されている場合は、プロジェクトのベースディレクトリで以下のコマンドを実行することで、 `spring-scheduled` エクステンションをプロジェクトに追加することができます。

source: If you already have your Quarkus project configured, you can add the `spring-web` extension to your project by running the following command in your project base directory:
ja_jp: すでにQuarkusプロジェクトが設定されている場合は、プロジェクトのベースディレクトリで以下のコマンドを実行することで、 `spring-web` エクステンションをプロジェクトに追加することができます。

source: If you already have your Quarkus project configured, you can add the `spring-web`, `spring-security` and `security-properties-file` extensions to your project by running the following command in your project base directory:
ja_jp: すでに Quarkus プロジェクトが設定されている場合は、プロジェクトのベースディレクトリーで以下のコマンドを実行することで、プロジェクトに `spring-web`、 `spring-security` および `security-properties-file` エクステンションを追加することができます。

source: If you already have your Quarkus project configured, you can add the `websockets-next` extension to your project by running the following command in your project base directory:
ja_jp: すでに Quarkus プロジェクトが設定されている場合は、プロジェクトのベースディレクトリーで以下のコマンドを実行することで、 プロジェクトに `websockets-next` エクステンションを追加できます。

source: If you already have your Quarkus project configured, you can add the `websockets` extension to your project by running the following command in your project base directory:
ja_jp: すでにQuarkusプロジェクトが設定されている場合は、プロジェクトのベースディレクトリーで以下のコマンドを実行することで、プロジェクトに `undertow-websockets` エクステンションを追加することができます。

source: If you already have your Quarkus project configured, you can add these extensions to your project by running the following command in your project base directory:
ja_jp: すでに Quarkus プロジェクトが設定されている場合は、プロジェクトのベースディレクトリーで以下のコマンドを実行することで、プロジェクトにこれらのエクステンションを追加できます。

source: If you already have your Quarkus project, you can add the `quarkus-opentelemetry` extension to it by running the following command in your project base directory:
ja_jp: Quarkusプロジェクトがすでに存在する場合、プロジェクトのベースディレクトリーで次のコマンドを実行することで、 `quarkus-opentelemetry` エクステンションを追加できます。

source: If you already use (or want to use) one of these tools, it is the simplest way to install the Quarkus CLI and keep it updated.
ja_jp: これらのツールのいずれかをすでに使用している (または使用したい) 場合、これは Quarkus CLI をインストールして最新の状態に保つ最も簡単な方法です。

source: If you also use Hibernate ORM multitenancy or MongoDB with Panache multitenancy and both tenant ids are the same, you can get the tenant id from the `RoutingContext` attribute with `tenant-id`. You can find more information here:
ja_jp: Hibernate ORM マルチテナントまたは MongoDB with Panache マルチテナントも使用しており、両方のテナント ID が同じである場合、 `RoutingContext` 属性から `tenant-id` を使用してテナント ID を取得できます。詳細は、次の URL を参照してください。

source: If you also use xref:hibernate-orm.adoc#multitenancy[Hibernate ORM multitenancy] and both OIDC and Hibernate ORM tenant IDs are the same and must be extracted from the Vert.x `RoutingContext` then you can pass the tenant id from the OIDC Tenant Resolver to the Hibernate ORM Tenant Resolver as a `RoutingContext` attribute, for example:
ja_jp: xref:hibernate-orm.adoc#multitenancy[Hibernate ORM マルチテナンシー] も使用し、OIDC と Hibernate ORM の両方のテナント ID が同じであり、Vert.x の `RoutingContext` から抽出する必要がある場合は、OIDC テナントリゾルバーから Hibernate ORM テナントリゾルバーにテナント ID を `RoutingContext` として渡すことができます。以下はその例です。

source: If you also use xref:hibernate-orm.adoc#multitenancy[Hibernate ORM multitenancy] or xref:mongodb-panache.adoc#multitenancy[MongoDB with Panache multitenancy] and both tenant ids are the same and must be extracted from the Vert.x `RoutingContext`, you can pass the tenant id from the OIDC Tenant Resolver to the Hibernate ORM Tenant Resolver or MongoDB with Panache Mongo Database Resolver as a `RoutingContext` attribute, for example:
ja_jp: xref:hibernate-orm.adoc#multitenancy[Hibernate ORM マルチテナンシー] または xref:mongodb-panache.adoc#multitenancy[MongoDB と Panache マルチテナンシー] も使用していて、両方のテナント ID が同じで、 Vert.x `RoutingContext` から抽出する必要がある場合は、テナント ID を OIDC テナントリゾルバーから、Hibernate ORM テナントリゾルバーまたは MongoDB と Panache Mongo データベースリゾルバーへ `RoutingContext` 属性として渡すことができます。以下に例を示します。

source: If you also use xref:security-openid-connect-multitenancy.adoc[OIDC multitenancy] and both OIDC and Hibernate ORM tenant IDs are the same and must be extracted from the Vert.x `RoutingContext` then you can pass the tenant id from the OIDC Tenant Resolver to the Hibernate ORM Tenant Resolver as a `RoutingContext` attribute, for example:
ja_jp: xref:security-openid-connect-multitenancy.adoc[OIDCマルチテナンシー]も使用していて、OIDCとHibernate ORMの両方のテナントIDが同じで、Vert.xの `RoutingContext` から抽出する必要がある場合は、OIDCテナントリゾルバからHibernate ORMテナントリゾルバに、 `RoutingContext` 属性としてテナントIDを渡すことができます。例:

source: If you also use xref:security-openid-connect-multitenancy.adoc[OIDC multitenancy] and both OIDC and Hibernate ORM tenant IDs are the same, you can get the OIDC tenant id from a `RoutingContext` attribute like in the example below:
ja_jp: xref:security-openid-connect-multitenancy.adoc[OIDC マルチテナンシー] も使用しており、OIDC と Hibernate ORM のテナント ID が同じ場合は、 以下の例のように `RoutingContext` 属性から OIDC のテナント ID を取得できます。

source: If you also use xref:security-openid-connect-multitenancy.adoc[OIDC multitenancy] and each OIDC tenant has its own associated `OidcClient` then you can use a Vert.x `RoutingContext` `tenantId` attribute, for example:
ja_jp: xref:security-openid-connect-multitenancy.adoc[OIDC multitenancy] を使用し、各 OIDC テナントが独自の関連する `OidcClient` を持っている場合は、Vert.x `RoutingContext` `tenantId` 属性を使用することができます。以下に例を示します。

source: If you also use xref:security-openid-connect-multitenancy.adoc[OIDC multitenancy], and each OIDC tenant has its own associated `OidcClient`, you can use a Vert.x `RoutingContext` `tenant-id` attribute.
ja_jp: xref:security-openid-connect-multitenancy.adoc[OIDC マルチテナンシー] も使用しており、各 OIDC テナントに独自の `OidcClient` が関連付けられている場合は、Vert.x `RoutingContext` `tenant-id` 属性を使用できます。

source: If you also use xref:security-openid-connect-multitenancy.adoc[OIDC multitenancy], and each OIDC tenant has its own associated `OidcClient`, you can use a Vert.x `RoutingContext` `tenant-id` attribute. For example:
ja_jp: xref:security-openid-connect-multitenancy.adoc[OIDCマルチテナンシー] も使用し、各 OIDC テナントに独自の関連付けられた `OidcClient` がある場合は、Vert.x `RoutingContext` `tenant-id` 属性を使用できます。次に例を示します。

source: If you also use xref:security-openid-connect-multitenancy.adoc[OIDC multitenancy], then if the OIDC tenantID and MongoDB database are the same, you can access the OIDC tenant id from a `RoutingContext` attribute like in the example below:
ja_jp: xref:security-openid-connect-multitenancy.adoc[OIDC マルチテナンシー] も使用している場合、OIDC のテナント ID と MongoDB データベースが同じであれば、次の例のように `RoutingContext` 属性から OIDC テナント ID にアクセスできます。

source: If you also want to refresh the token every time the `ProtectedResourceService#getUserName` call results in a 401 Unauthorized error, use the `quarkus.rest-client-oidc-filter.refresh-on-unauthorized` configuration property like in the example below:
ja_jp: `ProtectedResourceService#getUserName` の呼び出しが 401 Unauthorized エラーになった場合に常にトークンを更新したい場合は、以下の例のように `quarkus.rest-client-oidc-filter.refresh-on-unauthorized` 設定プロパティーを使用します。

source: If you also want to refresh the token every time the `ProtectedResourceService#getUserName` call results in a 401 Unauthorized error, use the `quarkus.rest-client-oidc-filter.refresh-on-unauthorized` configuration property, as in the following example:
ja_jp: `ProtectedResourceService#getUserName` の呼び出しが 401 Unauthorized エラーになった場合に毎回トークンを更新したい場合は、以下の例のように `quarkus.rest-client-oidc-filter.refresh-on-unauthorized` 設定プロパティーを使用します。

source: If you also want to refresh the token every time the `ProtectedResourceService#getUserName` call results in a 401 Unauthorized error, use the `quarkus.resteasy-client-oidc-filter.refresh-on-unauthorized` configuration property like in the example below:
ja_jp: `ProtectedResourceService#getUserName` の呼び出しが 401 Unauthorized エラーになった場合に常にトークンを更新したい場合は、以下の例のように `quarkus.resteasy-client-oidc-filter.refresh-on-unauthorized` 設定プロパティーを使用します。

source: If you also want to refresh the token every time the `ProtectedResourceService#getUserName` call results in a 401 Unauthorized error, use the `quarkus.resteasy-client-oidc-filter.refresh-on-unauthorized` configuration property, as in the following example:
ja_jp: `ProtectedResourceService#getUserName` の呼び出しが 401 Unauthorized エラーになった場合に毎回トークンを更新したい場合は、以下の例のように `quarkus.resteasy-client-oidc-filter.refresh-on-unauthorized` 設定プロパティーを使用します。

source: If you annotate a method with `@io.quarkus.scheduler.Scheduled` it is automatically scheduled for invocation. In fact, such a method must be a non-private non-static method of a CDI bean. As a consequence of being a method of a CDI bean a scheduled method can be annotated with interceptor bindings, such as `@javax.transaction.Transactional` and `@org.eclipse.microprofile.metrics.annotation.Counted`.
ja_jp: メソッドに `@io.quarkus.scheduler.Scheduled` をアノテーションすると、自動的に呼び出されるようにスケジュールされます。実際には、そのようなメソッドはCDI Beanの非プライベート非静的メソッドでなければなりません。CDI Beanのメソッドであることの結果として、スケジュールされたメソッドは、 `@javax.transaction.Transactional` や `@org.eclipse.microprofile.metrics.annotation.Counted` のようなインターセプターバインディングでアノテーションすることができます。

source: If you are a Java EE or Spring user, this development model should look familiar. You expose a resource containing methods annotated with <code>@GET</code>, <code>@POST</code>…&ZeroWidthSpace;&ZeroWidthSpace; to handle the different requests. The path is specified using the <code>@Path</code> annotation. Quarkus also supports <a href="https://quarkus.io/guides/spring-web">Spring controller</a> annotations such as <code>@GetMapping</code> or <code>@RestController</code>.
ja_jp: Java EEやSpringのユーザーであれば、この開発モデルは見覚えがあるはずです。異なるリクエストを処理するために、<code>@GET</code>、<code>@POST</code>...でアノテーションされたメソッドを含むリソースを公開します。パスは、<code>@Path</code>アノテーションを使用して指定します。Quarkusは、<code>@GetMapping</code>や<code>@RestController</code>のような<a href="https://quarkus.io/guides/spring-web">Spring controller</a>アノテーションもサポートしています。

source: If you are a Quarkus user or just curious, don't be shy and join our welcoming community:
ja_jp: Quarkusユーザーの場合でも、単に興味を持っているだけの場合でも、恥ずかしがらずにコミュニティに参加して下さい!:

source: If you are a Vert.x OIDC user, learn about migration options in the xref:security-vertx-oidc-to-quarkus-oidc-migration.adoc[Migrate from Vert.x OIDC to Quarkus OIDC] guide.
ja_jp: Vert.x OIDC ユーザーの場合は、xref:security-vertx-oidc-to-quarkus-oidc-migration.adoc[Vert.x OIDC から Quarkus OIDC への移行] ガイドで移行オプションについて学んでください。

source: If you are adding these properties via command line make sure `"` is escaped. For example `-Dquarkus.log.category.\"io.quarkus\".level=DEBUG`.
ja_jp: コマンドラインでこれらのプロパティーを追加する場合は、 `"` がエスケープされていることを確認してください。例えば `-Dquarkus.log.category.\"io.quarkus\".level=DEBUG` のようにします。

source: If you are adding these properties via command line make sure `"` is escaped. For example `-Dquarkus.log.category.\"org.hibernate\".level=TRACE`.
ja_jp: コマンドラインでこれらのプロパティーを追加する場合は、 `"` がエスケープされていることを確認してください。例えば `-Dquarkus.log.category.\"org.hibernate\".level=TRACE` とします。

source: If you are already familiar with Keycloak, you’ll notice that the extension is basically another adapter implementation but specific for Quarkus applications. Otherwise, you can find more information in the Keycloak https://www.keycloak.org/docs/latest/authorization_services/index.html#_enforcer_overview[documentation].
ja_jp: すでにKeycloakに慣れ親しんでいる方は、このエクステンションは基本的にはアダプターの別実装ですが、Quarkusアプリケーションに特化したものであることにお気づきでしょう。それ以外の場合は、Keycloakの link:https://www.keycloak.org/docs/latest/authorization_services/index.html#_enforcer_overview[ドキュメント] を参照してください。

source: If you are an AWS Lambda user we encourage you to try out Quarkus with and without AWS Snapstart and compare. Let us know your results and feedback.
ja_jp: AWS Lambda ユーザーの場合は、AWS Snapstart の有無にかかわらず Quarkus を試して比較することをお勧めします。 結果とフィードバックをお知らせください。

source: If you are an extension developer or want to contribute to Quarkus development, join our mailing list either <a href="mailto:quarkus-dev+subscribe@googlegroups.com">emailing us</a> or by visiting our <a href="https://groups.google.com/d/forum/quarkus-dev">Google Groups page</a>. Make sure you visit our extensive <a href="{{site.baseurl}}/guides/writing-extensions">Writing extensions guide</a>.
ja_jp: エクステンションの開発者か、Quarkusの開発に貢献したい場合、<a href="mailto:quarkus-dev+subscribe@googlegroups.com">emailする</a>か、<a href="https://groups.google.com/d/forum/quarkus-dev">Google Groupsページ</a>にアクセスしてメーリングリストに参加して下さい。 是非、充実した <a href="{{site.baseurl}}/guides/writing-extensions">エクステンション作成ガイド</a>にアクセスして下さい。

source: If you are are using gradle, you can apply the following plugin to your `build.gradle`:
ja_jp: gradle を使っている場合は、以下のプラグインを `build.gradle` に適用することができます。

source: If you are building a container image in order to deploy your Quarkus application as a Linux service with Podman and Systemd, you might want to consider including the https://docs.quarkiverse.io/quarkus-systemd-notify/dev/index.html[Quarkus Systemd Notify Extension] as part of your application, with:
ja_jp: PodmanとSystemdを使用してQuarkusアプリケーションをLinuxサービスとしてデプロイするためにコンテナイメージをビルドする場合、 link:https://docs.quarkiverse.io/quarkus-systemd-notify/dev/index.html[Quarkus Systemd Notify Extension] をアプリケーションの一部として含めることを検討するとよいでしょう：

source: If you are building a container image in order to deploy your Quarkus application as a Linux service with Podman and Systemd, you might want to consider including the https://quarkiverse.github.io/quarkiverse-docs/quarkus-systemd-notify/dev/index.html[Quarkus Systemd Notify Extension] as part of your application, with:
ja_jp: QuarkusアプリケーションをPodmanとSystemdでLinuxサービスとしてデプロイするためにコンテナイメージをビルドする場合、 次のように link:https://quarkiverse.github.io/quarkiverse-docs/quarkus-systemd-notify/dev/index.html[Quarkus Systemd Notify Extension] をアプリケーションの一部として含めることを検討するとよいかもしれません:

source: If you are building a reactive Quarkus application integrating with Redis: use `io.quarkus.redis.datasource.ReactiveRedisDataSource`.
ja_jp: Redis と統合したリアクティブな Quarkus アプリケーションを構築する場合は、 `io.quarkus.redis.datasource.ReactiveRedisDataSource` を使用します。

source: If you are building an imperative (_classic_) Quarkus application integrating with Redis: use `io.quarkus.redis.datasource.RedisDataSource`.
ja_jp: Redis と統合する命令型 (_classic_) の Quarkus アプリケーションを構築する場合、 `io.quarkus.redis.datasource.RedisDataSource` を使用します。

source: If you are building native images, and want to use https://aws.amazon.com/xray[AWS X-Ray Tracing] with your lambda you will need to include `quarkus-amazon-lambda-xray` as a dependency in your pom. The AWS X-Ray library is not fully compatible with GraalVM so we had to do some integration work to make this work.
ja_jp: ネイティブイメージをビルドしていて、Lambda で link:https://aws.amazon.com/xray[AWS X-Ray Tracing] を使いたい場合は、 `quarkus-amazon-lambda-xray` を依存関係として pom に含める必要があります。AWS X-Ray ライブラリは GraalVM との完全な互換性がないため、これを動作させるためにいくつかの統合作業をしなければなりませんでした。

source: If you are building native images, and want to use https://aws.amazon.com/xray[AWS X-Ray Tracing] with your lambda you will need to include `quarkus-amazon-lambda-xray` as a dependency in your pom. The AWS X-Ray library is not fully compatible with GraalVM, so we had to do some integration work to make this work.
ja_jp: ネイティブイメージをビルドしていて、Lambda で link:https://aws.amazon.com/xray[AWS X-Ray Tracing] を使いたい場合は、 `quarkus-amazon-lambda-xray` を依存関係として pom に含める必要があります。AWS X-Ray ライブラリは GraalVM との完全な互換性がないため、これを動作させるためにいくつかの統合作業をしなければなりませんでした。

source: If you are building on a non-Linux system, you will need to also pass in a property instructing Quarkus to use a Docker build as Amazon Lambda requires Linux binaries. You can do this by passing this property to your build: `-Dnative-image.docker-build=true`. This requires you to have Docker installed locally, however.
ja_jp: Linux 以外のシステムでビルドしている場合は、Amazon Lambda が Linux バイナリーを必要とするため、Docker ビルドを使用するように Quarkus に指示するプロパティーも渡す必要があります。これを行うには、`-Dnative-image.docker-build=true` プロパティーをビルドに渡します。ただし、これには Docker をローカルにインストールする必要があります。

source: If you are building on a non-Linux system, you will need to also pass in a property instructing Quarkus to use a docker build as Amazon Lambda requires linux binaries. You can do this by passing this property to your build: `-Dquarkus.native.container-build=true`. This requires you to have Docker installed locally, however.
ja_jp: Linux 以外のシステムでビルドしている場合は、Amazon Lambda が Linux バイナリーを必要とするため、Docker ビルドを使用するように Quarkus に指示するプロパティーも渡す必要があります。これを行うには、 `-Dquarkus.native.container-build=true` プロパティーをビルドに渡します。ただし、これには Docker をローカルにインストールする必要があります。

source: If you are building on a non-Linux system, you will need to also pass in a property instructing quarkus to use a Docker build as Amazon Lambda requires Linux binaries. You can do this by passing `-Dquarkus.native.container-build=true` to your build command. This requires you to have Docker installed locally, however.
ja_jp: Linux 以外のシステムでビルドしている場合は、Amazon Lambda が Linux バイナリーを必要とするため、Docker ビルドを使用するように Quarkus に指示するプロパティーも渡す必要があります。これを行うには、ビルドコマンドに `-Dquarkus.native.container-build=true` を渡します。ただし、これには Docker をローカルにインストールする必要があります。

source: If you are coming from the previous LTS, Quarkus 3.27 LTS, there are a lot of exciting new features and we recommend reading the following announcements:
ja_jp: 前回のLTSであるQuarkus 3.27 LTSから移行される場合、多くのエキサイティングな新機能がありますので、以下の発表をお読みになることをお勧めします。

source: If you are considering to migrate from Vert.x OIDC to Quarkus OIDC and have questions that may not have been answered in this guide, please https://quarkus.io/support/[reach out to the Quarkus team].
ja_jp: Vert.x OIDC から Quarkus OIDC への移行を検討しており、このガイドで回答されていない質問がある場合は、 https://quarkus.io/support/[Quarkus チームにお問い合わせください]。

source: If you are creating a new runtime-dev module, you must also add the conditional Dev dependency in the *runtime* module `pom.xml`:
ja_jp: 新しい runtime-dev モジュールを作成する場合は、*runtime* モジュールの `pom.xml` に条件付き Dev 依存関係も追加する必要があります。

source: If you are currently running 3.27 LTS, now is the right time to validate your upgrade path to 3.33 LTS, and let us know if you encounter any issues. Your feedback at this stage is especially valuable.
ja_jp: 現在 3.27 LTS を実行している場合は、今が 3.33 LTS へのアップグレードパスを検証するのに最適な時期です。問題が発生した場合はお知らせください。この段階でのフィードバックは特に貴重です。

source: If you are deploying on IBM Z infrastructure, enter `oc import-image {name-image-ubi9-open-jdk-21-short} --from=registry.redhat.io/{name-image-ubi9-open-jdk-21-short} --confirm` instead. For information about this image, see link:https://catalog.redhat.com/en/software/containers/ubi9/openjdk-21-runtime/6501ce769a0d86945c422d5f[OpenJDK 21 runtime image on UBI9].
ja_jp: IBM Z インフラストラクチャにデプロイする場合は、代わりに `oc import-image {name-image-ubi9-open-jdk-21-short} --from=registry.redhat.io/{name-image-ubi9-open-jdk-21-short} --confirm` を入力します。このイメージに関する情報は、 link:https://catalog.redhat.com/en/software/containers/ubi9/openjdk-21-runtime/6501ce769a0d86945c422d5f[UBI9 上の OpenJDK 21 ランタイムイメージ] を参照してください。

source: If you are deploying on IBM Z infrastructure, enter `oc import-image {name-image-ubi9-open-jdk-21-short} --from=registry.redhat.io/{name-image-ubi9-open-jdk-21-short} --confirm` instead. For information about this image, see link:https://catalog.redhat.com/software/containers/ubi9/openjdk-21/653fb7e21b2ec10f7dfc10d0[{runtimes-openjdk-long} 21].
ja_jp: IBM Zインフラストラクチャにデプロイする場合は、代わりに `oc import-image {name-image-ubi9-open-jdk-21-short} --from=registry.redhat.io/{name-image-ubi9-open-jdk-21-short} --confirm` を実行してください。 このイメージについては、 link:https://catalog.redhat.com/software/containers/ubi9/openjdk-21/653fb7e21b2ec10f7dfc10d0[{runtimes-openjdk-long} 21] を参照してください。

source: If you are deploying on IBM Z infrastructure, enter `oc new-app ubi9/openjdk-21~<git_path> --name=<project_name>` instead.
ja_jp: IBM Zインフラストラクチャにデプロイする場合は、代わりに `oc new-app ubi9/openjdk-21~<git_path> --name=<project_name>` を入力してください。

source: If you are familiar with using Hibernate ORM in Quarkus, you probably already have injected the `EntityManager` using CDI:
ja_jp: Quarkus で Hibernate ORM を使用することに慣れている場合は、CDI を使用してすでに `EntityManager` を注入しているでしょう。

source: If you are familiar with using Hibernate Reactive in Quarkus, you probably already have injected the `Mutiny.SessionFactory` using CDI:
ja_jp: QuarkusでHibernate Reactiveを使用することに慣れている方は、CDIを使用して `Mutiny.SessionFactory` を注入したことがあると思います。

source: If you are going to use security in a reactive environment, you will likely need SmallRye Context Propagation:
ja_jp: リアクティブな環境でセキュリティーを使用する場合は、SmallRye Context Propagationが必要になるでしょう。 :

source: If you are in a rush, the short answer is yes. Now let's go for the (not so) long answer.
ja_jp: 急いでいるのなら、短い答えは「イエス」です。では、（そうではない）長い答えに行きましょう。

source: If you are in a sandbox, also verify the recipients (using email verification)
ja_jp: サンドボックスの場合は、受信者の確認も行います（メール認証を使用する）

source: If you are in the rare situation that you need to change the build time configuration after your application is built, then check out how xref:reaugmentation.adoc[re-augmentation] can be used to rebuild the augmentation output for a different build time configuration.
ja_jp: アプリケーションのビルド後にビルド時の設定を変更する必要があるというまれな状況にある場合は、xref:reaugmentation.adoc[再オーグメンテーション] を使用して、別のビルド時設定のオーグメンテーション出力を再ビルドする方法を確認してください。

source: If you are installing JBang for the first time, start a new session to update your `PATH`.
ja_jp: JBang を初めてインストールする場合は、新しいセッションを開始して `PATH` を更新してください。

source: If you are interested in including the generated documentation for the config group, you can use the include statement below
ja_jp: 設定グループのために生成されたドキュメントを含めたい場合は、以下のinclude文を使用することができます。

source: If you are interested in it, please consult the xref:hibernate-search-orm-elasticsearch.adoc[Hibernate Search with Elasticsearch guide].
ja_jp: 興味のある方は、 xref:hibernate-search-orm-elasticsearch.adoc[Hibernate Search with Elasticsearchガイド] を参考にしてください。

source: If you are interested in learning more about Hibernate Search 6, the Hibernate team publishes link:{hibernate-search-doc-prefix}[an extensive reference documentation].
ja_jp: Hibernate Search 6について詳しく知りたい方は、Hibernateチームが link:{hibernate-search-doc-prefix}[広範なリファレンスドキュメント] を公開しています。

source: If you are interested in learning more about Hibernate Search, the Hibernate team publishes link:{hibernate-search-docs-url}[an extensive reference documentation], as well as a page listing https://hibernate.org/search/more-resources/[other relevant resources].
ja_jp: Hibernate Search の詳細については、 Hibernate チームが公開している link:{hibernate-search-docs-url}[多数の参照ドキュメント] および https://hibernate.org/search/more-resources/[その他の関連ドキュメント] を参照してください。

source: If you are interested in the details, the rationale and considerations for GitHub discussions are described in detail in https://github.com/quarkusio/quarkus/pull/19479[this pull-request].
ja_jp: 詳細に興味のある方は、GitHubでの議論の根拠や考慮事項について、 link:https://github.com/quarkusio/quarkus/pull/19479[このプルリクエスト]で詳しく説明しています。

source: If you are just starting with your application and intend to xref:hibernate-orm.adoc#dev-mode[let Hibernate ORM generate your database schema], then no worries: the entities required by Hibernate Search will be included in the generated schema.
ja_jp: アプリケーションを始めたばかりで、 xref:hibernate-orm.adoc#dev-mode[Hibernate ORMにデータベーススキーマを生成させる]つもりであれば、心配ありません。Hibernate Searchが必要とするエンティティは、生成されたスキーマに含まれます。

source: If you are looking for JAX-RS, Servlet or Vert.x support for Google Cloud Functions, we have it thanks to our xref:gcp-functions-http.adoc[Google Cloud Functions HTTP binding].
ja_jp: Google Cloud FunctionsのJAX-RS、Servlet、Vert.xのサポートを探しているなら、 xref:gcp-functions-http.adoc[Google Cloud Functions HTTP binding] が存在します。
